Compiler/o/GCC源码剖析1.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>GCC源码剖析[1]</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="GCC源码剖析[1]"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-03-14 18:02:28 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>



</head>
<body>


<div id="content">
<h1 class="title">GCC源码剖析[1]</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/style.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>



<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 tree</a></li>
<li><a href="#sec-2">2 gcc初始化</a></li>
<li><a href="#sec-3">3 preprocessor</a>
<ul>
<li><a href="#sec-3-1">3.1 cpp_get_token</a>
<ul>
<li><a href="#sec-3-1-1">3.1.1 cpp_token</a></li>
<li><a href="#sec-3-1-2">3.1.2 cpp_reader</a></li>
</ul>
</li>
<li><a href="#sec-3-2">3.2 do_include_common</a></li>
<li><a href="#sec-3-3">3.3 do_define</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> tree</h2>
<div class="outline-text-2" id="text-1">

<p>  每个tree结点都有一个code字段定义了此tree结点代表的类型，所有的类型在gcc/type.def文件中定义。<br/>
  宏TREE_CODE(node)返回指定结点对应code。<br/>
  拥有不同code的tree被分成类。<br/>
</p>
<p>
  首先看tree结点分类：<br/>
</p>


<pre class="src src-c"><span style="color: #a020f0;">enum</span> <span style="color: #228b22;">tree_code_class</span> {
  <span style="color: #a0522d;">tcc_exceptional</span>, <span style="color: #b22222;">/* </span><span style="color: #b22222;">An exceptional code (fits no category).  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">tcc_constant</span>,    <span style="color: #b22222;">/* </span><span style="color: #b22222;">A constant.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #b22222;">/* </span><span style="color: #b22222;">Order of tcc_type and tcc_declaration is important.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">tcc_type</span>,        <span style="color: #b22222;">/* </span><span style="color: #b22222;">A type object code.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">tcc_declaration</span>, <span style="color: #b22222;">/* </span><span style="color: #b22222;">A declaration (also serving as variable refs).  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">tcc_reference</span>,   <span style="color: #b22222;">/* </span><span style="color: #b22222;">A reference to storage.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">tcc_comparison</span>,  <span style="color: #b22222;">/* </span><span style="color: #b22222;">A comparison expression.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">tcc_unary</span>,       <span style="color: #b22222;">/* </span><span style="color: #b22222;">A unary arithmetic expression.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">tcc_binary</span>,      <span style="color: #b22222;">/* </span><span style="color: #b22222;">A binary arithmetic expression.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">tcc_statement</span>,   <span style="color: #b22222;">/* </span><span style="color: #b22222;">A statement expression, which have side effects</span>
<span style="color: #b22222;">              but usually no interesting value.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">tcc_vl_exp</span>,      <span style="color: #b22222;">/* </span><span style="color: #b22222;">A function call or other expression with a</span>
<span style="color: #b22222;">              variable-length operand vector.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">tcc_expression</span>   <span style="color: #b22222;">/* </span><span style="color: #b22222;">Any other expression.  </span><span style="color: #b22222;">*/</span>
};
</pre>


<p>
  tree.def 中定义tree的code值：<br/>
</p>


<pre class="src src-c">DEFTREECODE (IDENTIFIER_NODE, <span style="color: #8b2252;">"identifier_node"</span>, tcc_exceptional, 0)
</pre>

<p>
  其中DEFTREECODE宏：<br/>
</p>


<pre class="src src-c"><span style="color: #483d8b;">#define</span> <span style="color: #0000ff;">DEFTREECODE</span>(<span style="color: #a0522d;">SYM</span>, <span style="color: #a0522d;">STRING</span>, <span style="color: #a0522d;">TYPE</span>, <span style="color: #a0522d;">NARGS</span>)                   \
  (<span style="color: #228b22;">unsigned</span> <span style="color: #228b22;">char</span>)                               \
  ((TYPE) == tcc_unary ? GIMPLE_UNARY_RHS                   \
   : ((TYPE) == tcc_binary                          \
      || (TYPE) == tcc_comparison) ? GIMPLE_BINARY_RHS              \
   : ((TYPE) == tcc_constant                            \
      || (TYPE) == tcc_declaration                      \
      || (TYPE) == tcc_reference) ? GIMPLE_SINGLE_RHS               \
   : ((SYM) == TRUTH_AND_EXPR                           \
      || (SYM) == TRUTH_OR_EXPR                         \
      || (SYM) == TRUTH_XOR_EXPR) ? GIMPLE_BINARY_RHS               \
   : (SYM) == TRUTH_NOT_EXPR ? GIMPLE_UNARY_RHS                 \
   : ((SYM) == COND_EXPR                            \
      || (SYM) == WIDEN_MULT_PLUS_EXPR                      \
      || (SYM) == WIDEN_MULT_MINUS_EXPR                     \
      || (SYM) == DOT_PROD_EXPR                         \
      || (SYM) == REALIGN_LOAD_EXPR                     \
      || (SYM) == VEC_COND_EXPR                         \
      || (SYM) == VEC_PERM_EXPR                                             \
      || (SYM) == FMA_EXPR) ? GIMPLE_TERNARY_RHS                \
   : ((SYM) == CONSTRUCTOR                          \
      || (SYM) == OBJ_TYPE_REF                          \
      || (SYM) == ASSERT_EXPR                           \
      || (SYM) == ADDR_EXPR                         \
      || (SYM) == WITH_SIZE_EXPR                        \
      || (SYM) == SSA_NAME) ? GIMPLE_SINGLE_RHS                 \
   : GIMPLE_INVALID_RHS),
</pre>

<p>
  分别将TYPE与/SYM与tree_code_class中的值比较。<br/>
</p>


<pre class="src src-c"><span style="color: #a020f0;">enum</span> <span style="color: #228b22;">gimple_rhs_class</span>
{
  <span style="color: #a0522d;">GIMPLE_INVALID_RHS</span>,   <span style="color: #b22222;">/* </span><span style="color: #b22222;">The expression cannot be used on the RHS.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">GIMPLE_TERNARY_RHS</span>,   <span style="color: #b22222;">/* </span><span style="color: #b22222;">The expression is a ternary operation.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">GIMPLE_BINARY_RHS</span>,    <span style="color: #b22222;">/* </span><span style="color: #b22222;">The expression is a binary operation.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">GIMPLE_UNARY_RHS</span>, <span style="color: #b22222;">/* </span><span style="color: #b22222;">The expression is a unary operation.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">GIMPLE_SINGLE_RHS</span> <span style="color: #b22222;">/* </span><span style="color: #b22222;">The expression is a single object (an SSA</span>
<span style="color: #b22222;">               name, a _DECL, a _REF, etc.  </span><span style="color: #b22222;">*/</span>
};
</pre>


<p>
  gcc/treee.h<br/>
  tree_base, tree_typed, tree_common <br/>
</p>


<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">GTY</span>(()) tree_base {
  ENUM_BITFIELD(tree_code) code : 16;

  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">side_effects_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">constant_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">addressable_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">volatile_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">readonly_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">unsigned_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">asm_written_flag</span>: 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">nowarning_flag</span> : 1;

  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">used_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">nothrow_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">static_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">public_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">private_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">protected_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">deprecated_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">saturating_flag</span> : 1;

  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">default_def_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">lang_flag_0</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">lang_flag_1</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">lang_flag_2</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">lang_flag_3</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">lang_flag_4</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">lang_flag_5</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">lang_flag_6</span> : 1;

  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">visited</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">packed_flag</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">user_align</span> : 1;
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">nameless_flag</span> : 1;

  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">spare</span> : 12;

  <span style="color: #b22222;">/* </span><span style="color: #b22222;">This field is only used with type nodes; the only reason it is present</span>
<span style="color: #b22222;">     in tree_base instead of tree_type is to save space.  The size of the</span>
<span style="color: #b22222;">     field must be large enough to hold addr_space_t values.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #228b22;">unsigned</span> <span style="color: #a0522d;">address_space</span> : 8;
};

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">GTY</span>(()) tree_typed {
  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">tree_base</span> <span style="color: #a0522d;">base</span>;
  <span style="color: #228b22;">tree</span> <span style="color: #a0522d;">type</span>;
};

<span style="color: #a020f0;">struct</span> <span style="color: #228b22;">GTY</span>(()) tree_common {
  <span style="color: #a020f0;">struct</span> <span style="color: #228b22;">tree_typed</span> <span style="color: #a0522d;">typed</span>;
  <span style="color: #228b22;">tree</span> <span style="color: #a0522d;">chain</span>;
};
</pre>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> gcc初始化</h2>
<div class="outline-text-2" id="text-2">

<p>  初始化包括：命令行选项的解析、初始化后端、创建全局作用域、初始化内置数据类型和函数。<br/>
</p>
<p>
  gcc/toplev.c 包含 toplev_main函数及定义编译器状态的全局变量。<br/>
</p>


<pre class="example">toplev_main用来处理命令行选项、初始化编译器、编译文件、释放已分配资源。
首先调用了decode_options函数：解析命令行选项并设置编译器内部相应变量。
之后调用了do_compile函数：初始化编译器并编译输入文件。
        do_compile调用了backend_init函数：初始化编译器后端。
              backend_init调用了init_emit_once函数：创建一些被所有函数共享的RTL对象。
        之后调用了lang_dependent_init函数：用来做语言依赖的初始化工作。
              比如C会调用c_objc_common_init来进行C语言的内置数据类型、全局作用域和其它任务的初始化，
                      它会调用c_common_nodes_and_builtins来建立tree结点的内置函数(在gcc/builtin-types.def中定义)。
        之后调用了compile_file：编译整个翻译单元，输出汇编文件和各种调试dumps。
              compile_file又调用了parse_file，对C来说是c_common_parse_file
                      调用了c_finish_options来处理-D, -U, -A（分别对应#define, #undef, #assert）, -i宏和第1个-include。
</pre>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> preprocessor</h2>
<div class="outline-text-2" id="text-3">

<p>  预处理用来处理类似#include/#ifdef/#undef之类的关键字。<br/>
  这些函数在libcp/directive.c中，以do_开头的函数，例如：<br/>
  <code>do_include/do_include_next/do_undef/do_define/do_import/do_warning/do_pragma/do_ifdef/do_ifndef/do_if/do_else/do_endif/do_assert/do_unassert</code><br/>
</p>
</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> cpp_get_token</h3>
<div class="outline-text-3" id="text-3-1">

<p>   <code>const cpp_token * cpp_get_token (cpp_reader *pfile)</code><br/>
   cpp_get_token用来处理预处理关键字<br/>
</p>
</div>

<div id="outline-container-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> cpp_token</h4>
<div class="outline-text-4" id="text-3-1-1">




<pre class="src src-c"><span style="color: #a020f0;">struct</span> <span style="color: #228b22;">cpp_token</span> {
  __extension__ <span style="color: #a020f0;">enum</span> <span style="color: #228b22;">cpp_ttype</span> <span style="color: #a0522d;">type</span> : 8;
};
</pre>

<p>
  结构体cpp_token中只一个大小为8bit的成员type，其类型为enum cpp_ttype.<br/>
</p>


<pre class="src src-c"><span style="color: #a020f0;">enum</span> <span style="color: #228b22;">cpp_ttype</span>
{
  <span style="color: #228b22;">TTYPE_TABLE</span>
  <span style="color: #a0522d;">N_TTYPES</span>,

  <span style="color: #b22222;">/* </span><span style="color: #b22222;">Positions in the table.  </span><span style="color: #b22222;">*/</span>
  <span style="color: #a0522d;">CPP_LAST_EQ</span>        = CPP_LSHIFT,
  <span style="color: #a0522d;">CPP_FIRST_DIGRAPH</span>  = CPP_HASH,
  <span style="color: #a0522d;">CPP_LAST_PUNCTUATOR</span>= CPP_ATSIGN,
  <span style="color: #a0522d;">CPP_LAST_CPP_OP</span>    = CPP_LESS_EQ
};
</pre>

<p>
  宏TTYPE_TABLE宏类似：<br/>
</p>


<pre class="src src-c"><span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">TTYPE_TABLE</span>                         \
  OP(EQ,        <span style="color: #8b2252;">"="</span>)                        \
  OP(NOT,       <span style="color: #8b2252;">"!"</span>)                        \
  OP(GREATER,       <span style="color: #8b2252;">"&gt;"</span>)    <span style="color: #b22222;">/* </span><span style="color: #b22222;">compare </span><span style="color: #b22222;">*/</span>               \
  OP(LESS,      <span style="color: #8b2252;">"&lt;"</span>)                        \
  OP(PLUS,      <span style="color: #8b2252;">"+"</span>)    <span style="color: #b22222;">/* </span><span style="color: #b22222;">math </span><span style="color: #b22222;">*/</span>              \
</pre>

<p>
  OP宏为<br/>
</p>


<pre class="example">#define OP(e, s) CPP_ ## e,
</pre>

<p>
  其实OP(EQ, "=")中的"="是个注释，因为没有被用到，其作用就是表明EQ代表着什么。<br/>
  cpp_ttype展开就是：<br/>
</p>


<pre class="src src-c"><span style="color: #a020f0;">enum</span> <span style="color: #228b22;">cpp_ttype</span>{
  <span style="color: #a0522d;">CPP_EQ</span>,
  <span style="color: #a0522d;">CPP_NOT</span>,
  <span style="color: #a0522d;">CPP_GREATER</span>,
  ......
  N_TTYPES,
  <span style="color: #b22222;">/* </span><span style="color: #b22222;">Positions in the table.  </span><span style="color: #b22222;">*/</span>
  CPP_LAST_EQ        = CPP_LSHIFT,
  CPP_FIRST_DIGRAPH  = CPP_HASH,
  CPP_LAST_PUNCTUATOR= CPP_ATSIGN,
  CPP_LAST_CPP_OP    = CPP_LESS_EQ
};
</pre>

<p>
  其中的N_TTYPES表示记法单元token的个数。<br/>
</p></div>

</div>

<div id="outline-container-3-1-2" class="outline-4">
<h4 id="sec-3-1-2"><span class="section-number-4">3.1.2</span> cpp_reader</h4>
<div class="outline-text-4" id="text-3-1-2">

</div>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> do_include_common</h3>
<div class="outline-text-3" id="text-3-2">

<p>  <code>static void do_include_common (cpp_reader *, enum include_type);</code><br/>
  遇到#include/#include_next/#import关键字.<br/>
</p>


<pre class="src src-c"><span style="color: #a020f0;">enum</span> <span style="color: #228b22;">include_type</span> {<span style="color: #a0522d;">IT_INCLUDE</span>, <span style="color: #a0522d;">IT_INCLUDE_NEXT</span>, <span style="color: #a0522d;">IT_IMPORT</span>, <span style="color: #a0522d;">IT_CMDLINE</span>};
</pre>

</div>

</div>

<div id="outline-container-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> do_define</h3>
<div class="outline-text-3" id="text-3-3">

<p>   处理#define指令<br/>
</p></div>
</div>
</div>
</div>

</body>
</html>
